-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2025-06-08 18:19:59
-- 伺服器版本： 10.4.32-MariaDB
-- PHP 版本： 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `travel_pockets`
--

-- --------------------------------------------------------

--
-- 資料表結構 `members`
--

CREATE TABLE `members` (
  `member_id` int(11) NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `member_name` varchar(50) DEFAULT NULL,
  `member_user_id` int(11) DEFAULT NULL,
  `member_relationship_name` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `members`
--

INSERT INTO `members` (`member_id`, `user_id`, `member_name`, `member_user_id`, `member_relationship_name`) VALUES
(1, 1, 'John', 1, 'alice'),
(2, 1, 'Mary', 1, 'alice'),
(3, 2, 'aoa', 2, 'amy'),
(4, 2, 'cindy', 2, 'amy'),
(5, 3, 'Tom', 3, 'bob');

-- --------------------------------------------------------

--
-- 資料表結構 `members_wishlist`
--

CREATE TABLE `members_wishlist` (
  `wishlist_id` int(11) NOT NULL,
  `member_id` int(11) DEFAULT NULL,
  `place_id` int(11) DEFAULT NULL,
  `place_name` varchar(100) DEFAULT NULL,
  `member_name` varchar(50) DEFAULT NULL,
  `want_go` varchar(50) DEFAULT NULL,
  `been_there` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `members_wishlist`
--

INSERT INTO `members_wishlist` (`wishlist_id`, `member_id`, `place_id`, `place_name`, `member_name`, `want_go`, `been_there`) VALUES
(1, 1, 1, '台北101', 'John', '想去', '沒去過'),
(2, 1, 88, '彩虹眷村', 'John', '想去', '去過'),
(3, 1, 45, '和平島', 'John', '不想去', '去過'),
(4, 1, 14, '桃園夜市', 'John', '不想去', '沒去過'),
(5, 2, 1, '台北101', 'Mary', '想去', '去過'),
(6, 2, 6, '士林夜市', 'Mary', '想去', '沒去過'),
(7, 2, 15, '中原商圈', 'Mary', '想去', '去過'),
(9, 3, 46, '摩爾花園', 'aoa', '想去', '沒去過'),
(10, 3, 12, '好滋味海鮮麵', 'aoa', '想去', '沒去過'),
(11, 3, 77, '澄霖沉香味道森林館', 'aoa', '不想去', '去過'),
(12, 3, 80, '一中街商圈', 'aoa', '不想去', '去過'),
(13, 4, 23, 'OUVERT SEOUL', 'cindy', '想去', '去過'),
(14, 4, 34, '六福村主題樂園', 'cindy', '不想去', '去過'),
(15, 4, 15, '吾時•食', 'cindy', '不想去', '沒去過'),
(16, 4, 16, '沒有特別計畫咖啡', 'cindy', '想去', '沒去過'),
(17, 5, 58, '清境紙箱王', 'Tom', '不想去', '沒去過'),
(18, 5, 22, '芙米咖啡', 'Tom', '想去', '去過'),
(19, 5, 19, '燒肉政宗', 'Tom', '想去', '沒去過'),
(20, 5, 40, 'Xpark 都會型水生公園', 'Tom', '不想去', '去過');

-- --------------------------------------------------------

--
-- 資料表結構 `places`
--

CREATE TABLE `places` (
  `place_id` int(11) NOT NULL,
  `place_name` varchar(100) DEFAULT NULL,
  `location` varchar(100) DEFAULT NULL,
  `region` varchar(100) DEFAULT NULL,
  `type` varchar(50) DEFAULT NULL,
  `cost` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `places`
--

INSERT INTO `places` (`place_id`, `place_name`, `location`, `region`, `type`, `cost`) VALUES
(1, '台北101', '台北市', '北部', '景點', 1000),
(2, '中正紀念堂', '台北市', '北部', '景點', 0),
(3, '國立故宮博物院', '台北市', '北部', '景點', 150),
(4, '陽明山國家公園', '台北市', '北部', '景點', 445),
(5, '淡水老街', '新北市', '北部', '美食', 300),
(6, '士林夜市', '台北市', '北部', '美食', 500),
(7, '饒河夜市', '台北市', '北部', '美食', 300),
(8, '永康牛肉麵', '台北市', '北部', '美食', 200),
(9, '阿宗麵線', '台北市', '北部', '美食', 150),
(10, '阜杭豆漿', '台北市', '北部', '美食', 150),
(11, '信義誠品', '台北市', '北部', '購物', 500),
(12, '微風廣場', '台北市', '北部', '購物', 1000),
(13, '新光三越信義店', '台北市', '北部', '購物', 1000),
(14, '桃園夜市', '桃園市', '北部', '購物', 300),
(15, '中原商圈', '桃園市', '北部', '購物', 500),
(16, '大江購物中心', '桃園市', '北部', '景點', 1000),
(17, '華泰名品城', '桃園市', '北部', '景點', 1000),
(18, '台茂購物中心', '桃園市', '北部', '購物', 1000),
(19, 'Nuageクラウド雲朵鬆餅', '桃園市', '北部', '景點', 150),
(20, '阿美米干', '桃園市', '北部', '美食', 100),
(21, '驚嘆號臭豆腐', '桃園市', '北部', '美食', 70),
(22, '好滋味海鮮麵', '桃園市', '北部', '美食', 150),
(23, '曾記老牌水煎包', '桃園市', '北部', '美食', 8),
(24, 'THE．春', '新北市', '北部', '美食', 400),
(25, '吾時•食', '新北市', '北部', '美食', 300),
(26, '沒有特別計畫咖啡', '新北市', '北部', '美食', 300),
(27, '大樂串燒', '新北市', '北部', '美食', 300),
(28, '九份茶坊', '新北市', '北部', '美食', 400),
(29, '燒肉政宗', '新北市', '北部', '美食', 800),
(30, '安太座烘焙坊', '新北市', '北部', '美食', 100),
(31, '羊水', '新北市', '北部', '美食', 200),
(32, '芙米咖啡', '新北市', '北部', '美食', 200),
(33, 'OUVERT SEOUL', '台北市', '北部', '美食', 300),
(34, '香色 Xiang Se', '台北市', '北部', '美食', 300),
(35, '旺角石頭火鍋', '台北市', '北部', '美食', 250),
(36, '橘色涮涮屋', '台北市', '北部', '美食', 2000),
(37, '詹記麻辣火鍋', '台北市', '北部', '美食', 1000),
(38, '雙月食品社', '台北市', '北部', '美食', 500),
(39, 'FB Kitchen', '台北市', '北部', '美食', 300),
(40, '飯糰霸', '台北市', '北部', '美食', 60),
(41, '菜園', '新竹市', '北部', '美食', 500),
(42, '小叮噹科學主題樂園', '新竹市', '北部', '景點', 329),
(43, '北埔老街', '新竹市', '北部', '美食', 300),
(44, '六福村主題樂園', '新竹市', '北部', '景點', 799),
(45, '和平島', '基隆市', '北部', '景點', 0),
(46, '富田花園農場', '桃園市', '北部', '景點', 395),
(47, '小人國主題樂園', '桃園市', '北部', '景點', 690),
(48, '埔心牧場', '桃園市', '北部', '景點', 300),
(49, '大溪老街', '桃園市', '北部', '美食', 300),
(50, 'Xpark 都會型水生公園', '桃園市', '北部', '景點', 600),
(51, '貓空纜車＆動物園', '台北市', '北部', '景點', 300),
(52, '淡水古蹟博物館', '台北市', '北部', '景點', 0),
(53, '深澳鐵道自行車 Rail Bike', '台北市', '北部', '景點', 0),
(54, '卡滋爆米花觀光工廠樂園', '台北市', '北部', '景點', 150),
(55, '三峽大板根森林園區', '新北市', '北部', '景點', 150),
(56, '台北野柳地質公園', '台北市', '北部', '景點', 0),
(57, '平溪車站', '台北市', '北部', '景點', 0),
(58, '深坑老街', '台北市', '北部', '美食', 300),
(59, '摩爾花園', '彰化縣', '中部', '美食', 300),
(60, '老鄰居1971', '雲林縣', '中部', '美食', 300),
(61, '長興圓仔冰', '雲林縣', '中部', '美食', 70),
(62, '碳烤鴨蛋糕', '雲林縣', '中部', '美食', 50),
(63, '有片森林植一座咖啡館(毛巾捲)', '彰化縣', '中部', '美食', 150),
(64, '咖啡鑽', '台中市', '中部', '美食', 200),
(65, '52 cafe’ ', '台中市', '中部', '美食', 200),
(66, '木寧日常', '南投縣', '中部', '美食', 100),
(67, '木茶房', '南投縣', '中部', '美食', 100),
(68, '清境紙箱王', '南投縣', '中部', '美食', 100),
(69, '金榜麵館', '苗栗縣', '中部', '美食', 100),
(70, '賴新魁麵館', '苗栗縣', '中部', '美食', 100),
(71, '虎尾鐵橋', '雲林縣', '中部', '景點', 0),
(72, '虎尾糖廠', '雲林縣', '中部', '景點', 0),
(73, '興隆毛巾觀光工廠', '雲林縣', '中部', '景點', 0),
(74, '彩繪剪紙藝術村', '雲林縣', '中部', '景點', 0),
(75, '貓咪小學堂', '雲林縣', '中部', '景點', 0),
(76, '菓風巧克力工房', '雲林縣', '中部', '景點', 0),
(77, '澄霖沉香味道森林館', '雲林縣', '中部', '美食', 219),
(78, '秀泰生活台中站前', '南投縣', '中部', '購物', 1000),
(79, '大遠百台中店', '台中市', '中部', '購物', 1000),
(80, '一中街商圈', '台中市', '中部', '購物', 500),
(81, '逢甲夜市', '台中市', '中部', '美食', 300),
(82, '高美濕地', '台中市', '中部', '景點', 0),
(83, '第二市場', '台中市', '中部', '美食', 150),
(84, '大慶夜市', '台中市', '中部', '景點', 300),
(85, '中央公園', '台中市', '中部', '景點', 0),
(86, '勤美術館', '台中市', '中部', '景點', 300),
(87, '宮原眼科', '台中市', '中部', '美食', 100),
(88, '彩虹眷村', '台中市', '中部', '景點', 0),
(89, '龍騰斷橋', '苗栗縣', '中部', '景點', 0),
(90, '大湖草莓文化館', '苗栗縣', '中部', '景點', 0),
(91, '勝興車站', '苗栗縣', '中部', '景點', 0),
(92, '卓也小屋', '苗栗縣', '中部', '美食', 200),
(93, '向山眺望平台', '南投縣', '中部', '景點', 0),
(94, '外埔忘憂谷', '台中市', '中部', '景點', 0),
(95, '武陵農場', '台中市', '中部', '景點', 0),
(96, '奧萬大國家森林遊樂區', '南投縣', '中部', '景點', 100),
(97, '成美文化園', '彰化縣', '中部', '景點', 100),
(98, 'MLD台鋁生活商場', '高雄市', '南部', '景點', 0),
(99, '潮州徐豆花', '屏東縣', '南部', '美食', 100),
(100, '北港蔡三代筒仔米糕', '高雄市', '南部', '美食', 100),
(101, '石精臼虎頭風味小吃', '台南市', '南部', '美食', 100),
(102, '豆簽羹、麻油米糕', '台南市', '南部', '美食', 150),
(103, '香腸熟肉', '台南市', '南部', '美食', 100),
(104, '台南三井outlet', '台南市', '南部', '購物', 1000),
(105, '林百貨', '台南市', '南部', '購物', 500),
(106, '南紡購物中心', '台南市', '南部', '購物', 1000),
(107, '鴨肉珍', '台南市', '南部', '美食', 200),
(108, '丹丹漢堡', '台南市', '南部', '美食', 200),
(109, '鴨母寮市場', '台南市', '南部', '美食', 300),
(110, '安平豆花', '台南市', '南部', '美食', 200),
(111, '太魯閣國家公園', '宜蘭縣', '東部', '景點', 500),
(112, '東大門夜市', '台東縣', '東部', '美食', 300),
(113, '六合夜市', '台南市', '南部', '美食', 300),
(114, 'SKM Park', '高雄市', '南部', '購物', 1000),
(115, '夢時代', '高雄市', '南部', '購物', 1000),
(116, '大遠百高雄店', '高雄市', '南部', '購物', 1000),
(117, '花蓮金三角商圈', '花蓮縣', '東部', '購物', 500),
(118, '廟口蕃茄切盤', '高雄市', '南部', '美食', 50),
(119, '美濃花生豆腐', '高雄市', '南部', '美食', 100),
(120, '阿英婆的客家廚房', '屏東縣', '南部', '美食', 500),
(121, '菜鴨魯熟肉', '嘉義縣', '南部', '美食', 100),
(122, '黃記涼麵涼圓', '嘉義縣', '南部', '美食', 80),
(123, '上海脆皮烤饅頭', '台南市', '南部', '美食', 6),
(124, '真珠丸', '台南市', '南部', '美食', 10),
(125, '6元肉丸', '台南市', '南部', '美食', 6),
(126, '武聖夜市', '台南市', '南部', '美食', 300),
(127, '食圓蛋糕', '台南市', '南部', '美食', 10),
(128, '盧家麵食 (里長麵)', '台南市', '南部', '美食', 50),
(129, '小叮噹銅鑼燒', '台南市', '南部', '美食', 70),
(130, '十元肉圓', '台南市', '南部', '美食', 10),
(131, '2元黑輪', '台南市', '南部', '美食', 50),
(132, '合作金庫熱狗攤', '雲林縣', '中部', '美食', 100),
(133, '德記洋行安平樹屋', '台南市', '南部', '景點', 150),
(134, '雅聞湖濱療癒森林', '台南市', '南部', '景點', 0),
(135, '臺南市美術館2館', '台南市', '南部', '景點', 200),
(136, '奇美博物館', '台南市', '南部', '景點', 200),
(137, '安平古堡', '台南市', '南部', '景點', 0),
(138, '國立故宮博物院南院', '嘉義縣', '南部', '景點', 150),
(139, '阿里山國家森林遊樂區', '嘉義縣', '南部', '景點', 100),
(140, '三隻小豬觀光農場', '嘉義縣', '南部', '景點', 130),
(141, '駁二特區', '高雄市', '南部', '景點', 0),
(142, '義大遊樂世界', '高雄市', '南部', '景點', 670),
(143, '佛光山', '高雄市', '南部', '景點', 0),
(144, '西子灣', '高雄市', '南部', '景點', 0),
(145, 'HoloPark', '高雄市', '南部', '景點', 0),
(146, '鹿境梅花鹿生態園區', '屏東縣', '南部', '景點', 230),
(147, '屏東海生館', '屏東縣', '南部', '景點', 400),
(148, '阿信巧克力農場', '屏東縣', '南部', '景點', 170),
(149, '黑點師魯肉飯', '花蓮縣', '東部', '美食', 100),
(150, '愛上這味懷舊餐廳', '花蓮縣', '東部', '美食', 500),
(151, '松賀家', '花蓮縣', '東部', '美食', 500),
(152, '一碗小', '花蓮縣', '東部', '美食', 100),
(153, '周家蒸餃', '花蓮縣', '東部', '美食', 100),
(154, '炸彈蔥油餅', '花蓮縣', '東部', '美食', 100),
(155, '公正包子', '花蓮縣', '東部', '美食', 100),
(156, '來打餃', '花蓮縣', '東部', '美食', 200),
(157, '成康飲食店', '花蓮縣', '東部', '美食', 300),
(158, '小巷茉莉', '花蓮縣', '東部', '美食', 300),
(159, '慶修院', '花蓮縣', '東部', '景點', 0),
(160, '新社梯田', '花蓮縣', '東部', '景點', 0),
(161, '瑞穗牧場', '花蓮縣', '東部', '景點', 0),
(162, '親不知子天空步道', '花蓮縣', '東部', '景點', 0),
(163, '鯉魚潭', '花蓮縣', '東部', '景點', 0),
(164, '七星潭', '花蓮縣', '東部', '景點', 0),
(165, '流水森林', '宜蘭縣', '東部', '美食', 500),
(166, '蘭波', '宜蘭縣', '東部', '美食', 500),
(167, '味珍香卜肉店', '宜蘭縣', '東部', '美食', 500),
(168, '北門蒜味肉羹', '宜蘭縣', '東部', '美食', 100),
(169, '正好鮮肉小籠包', '宜蘭縣', '東部', '美食', 100),
(170, '蘭陽香辣麵', '宜蘭縣', '東部', '美食', 100),
(171, '阿灶伯當歸羊肉湯', '宜蘭縣', '東部', '美食', 200),
(172, '無名蝦餅店', '宜蘭縣', '東部', '美食', 100),
(173, '柯氏蔥油餅', '宜蘭縣', '東部', '美食', 50),
(174, '那山那谷', '宜蘭縣', '東部', '景點', 0),
(175, '長埤湖精靈村', '宜蘭縣', '東部', '景點', 200),
(176, '幾米公園', '宜蘭縣', '東部', '景點', 0),
(177, '東澳烏岩角海蝕洞', '宜蘭縣', '東部', '購物', 0),
(178, '梅花湖風景區', '宜蘭縣', '東部', '景點', 75),
(179, '無尾港水鳥保護區', '宜蘭縣', '東部', '景點', 0),
(180, '草嶺古道', '宜蘭縣', '東部', '景點', 0),
(181, 'Robert Y 廢墟-暴龍館', '宜蘭縣', '東部', '購物', 200),
(182, '菌寶貝博物館', '宜蘭縣', '東部', '景點', 0),
(183, '積木博物館', '宜蘭縣', '東部', '景點', 0),
(184, '鳳梨屋水上莊園', '宜蘭縣', '東部', '景點', 300),
(185, '鴨寮故事館', '宜蘭縣', '東部', '景點', 100),
(186, '星夢森林劇場', '宜蘭縣', '東部', '景點', 200),
(187, 'healtdeva赫蒂法莊園', '宜蘭縣', '東部', '景點', 200),
(188, '森森咖啡sunsuncoffee', '台東縣', '東部', '美食', 400),
(189, '老東台米台目', '台東縣', '東部', '景點', 150),
(190, '大眾滷肉飯', '台東縣', '東部', '美食', 200),
(191, '阿鋐炸雞', '台東縣', '東部', '美食', 150),
(192, '瘦仔羊肉', '台東縣', '東部', '美食', 500),
(193, '早點大王', '台東縣', '東部', '美食', 150),
(194, '麻里マリ朝午食', '台東縣', '東部', '美食', 250),
(195, '太麻里櫻木平交道', '台東縣', '東部', '景點', 0),
(196, '多良車站', '台東縣', '東部', '景點', 0),
(197, '宜灣卡片教堂', '台東縣', '東部', '景點', 0),
(198, '伯朗大道', '台東縣', '東部', '景點', 0),
(199, '長濱金剛大道', '台東縣', '東部', '景點', 0),
(200, '張美阿嬤農場', '宜蘭縣', '東部', '景點', 250),
(201, '澎湖跨海大橋', '澎湖縣', '南部', '景點', 0);

-- --------------------------------------------------------

--
-- 資料表結構 `users`
--

CREATE TABLE `users` (
  `user_id` int(11) NOT NULL,
  `username` varchar(50) NOT NULL,
  `password` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `users`
--

INSERT INTO `users` (`user_id`, `username`, `password`) VALUES
(1, 'alice', '1234'),
(2, 'amy', '4567'),
(3, 'bob', '7890'),
(4, 'cc', '2222'),
(5, 'dd', '4444');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `members`
--
ALTER TABLE `members`
  ADD PRIMARY KEY (`member_id`),
  ADD KEY `user_id` (`user_id`);

--
-- 資料表索引 `members_wishlist`
--
ALTER TABLE `members_wishlist`
  ADD PRIMARY KEY (`wishlist_id`),
  ADD KEY `member_id` (`member_id`),
  ADD KEY `place_id` (`place_id`);

--
-- 資料表索引 `places`
--
ALTER TABLE `places`
  ADD PRIMARY KEY (`place_id`);

--
-- 資料表索引 `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`user_id`),
  ADD UNIQUE KEY `username` (`username`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `members`
--
ALTER TABLE `members`
  MODIFY `member_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `members_wishlist`
--
ALTER TABLE `members_wishlist`
  MODIFY `wishlist_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `places`
--
ALTER TABLE `places`
  MODIFY `place_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=203;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `users`
--
ALTER TABLE `users`
  MODIFY `user_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- 已傾印資料表的限制式
--

--
-- 資料表的限制式 `members`
--
ALTER TABLE `members`
  ADD CONSTRAINT `members_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`user_id`);

--
-- 資料表的限制式 `members_wishlist`
--
ALTER TABLE `members_wishlist`
  ADD CONSTRAINT `members_wishlist_ibfk_1` FOREIGN KEY (`member_id`) REFERENCES `members` (`member_id`),
  ADD CONSTRAINT `members_wishlist_ibfk_2` FOREIGN KEY (`place_id`) REFERENCES `places` (`place_id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
